app/controllers/cast_members_controller.rb

  def index
    @movie_id = params[:id]
    if @movie_id.nil?
      @cast_members = CastMember.all.sort_by {|a| a.name.capitalize}
    else
      @cast_members = Movie.find(@movie_id).cast_members
---
SELECT "cast_members".* FROM "cast_members"
SELECT  "cast_members".* FROM "cast_members" WHERE "cast_members"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def show
    @cast_member = CastMember.find(params[:id])
---
SELECT  "cast_members".* FROM "cast_members" WHERE "cast_members"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]