app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "director") VALUES ($1, $2) RETURNING "id"  [["title", "Jurassic Park"], ["director", "Steven Spielberg"]]
---
  def create
  	if params[:title]!="" && params[:director]!=""
  		@movie = Movie.create title:params[:title], director:params[:director]

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 46], ["LIMIT", 1]]
UPDATE "movies" SET "director" = ? WHERE "movies"."id" = ?  [["director", "unknown"], ["id", 46]]
---
  def update
  	Movie.find(params[:id]).update title: params[:title], director: params[:director]
		@movie = Movie.find(params[:id])

DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 9]]
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def destroy
  	Movie.find(params[:id]).destroy

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "cast_members".* FROM "cast_members" WHERE "cast_members"."name" = ? LIMIT ?  [["name", "Sam Neill"], ["LIMIT", 1]]
INSERT INTO "cast_members" ("name", "role") VALUES (?, ?)  [["name", "Al Pacino"], ["role", "Actor"]]
INSERT INTO "cast_members" ("name", "role") VALUES ($1, $2) RETURNING "id"  [["name", "Sam Neill"], ["role", "Actor"]]
SELECT  "cast_members".* FROM "cast_members" WHERE "cast_members"."name" = ? LIMIT ?  [["name", "Al Pacino"], ["LIMIT", 1]]
SELECT  "movies".* FROM "movies" INNER JOIN "cast_members_movies" ON "movies"."id" = "cast_members_movies"."movie_id" WHERE "cast_members_movies"."cast_member_id" = ? AND "movies"."id" = ? LIMIT ?  [["cast_member_id", 11], ["id", 3], ["LIMIT", 1]]
---
  def addActor
		@movie = Movie.find(params[:movie_id])
		unless params[:name]=="" || params[:role]==""
			if CastMember.find_by_name(params[:name]).nil?
				@cast_member = CastMember.new name: params[:name], role: params[:role]
				@cast_member.movies<< @movie
				@cast_member.save
			else
				unless !CastMember.find_by_name(params[:name]).movies.find_by_id(@movie.id).nil?
					@cast_member = CastMember.find_by_name(params[:name])